app/Controllers/Dashboard.php

SELECT *
FROM `short`
WHERE `user_id` = '1'
ORDER BY `created_at` ASC
---
    public function index()
    {
        $user_id = session()->get('user_id');
        $Short_db = new ShortModel();
        if ($user_id != 0) $query = $Short_db->where('user_id', $user_id);
        $query = $Short_db->orderBy('created_at', 'ASC')->findAll();