app/Controllers/Dashboard.php

    public function index()
    {
        $session = session();
        $Short_db = new ShortModel();
        $query = $Short_db->findAll();
---
SELECT *
FROM `short`