app/Controllers/Short.php

SELECT *
FROM `short`
WHERE `slug` = 'X18kL'
 LIMIT 1
INSERT INTO `short` (`url`, `slug`, `counter`, `is_active`) VALUES ('https://www.youtube.com/', 'X18kL', 0, 1)
---
    public function shortedLink()
    {
        $url = $this->request->getVar('url');
        $user_id = $this->request->getVar('user_id');

        if (substr($url, 0, 4) != 'http') {
            $url = "https://$url";
        };

        $Short_db = new ShortModel();

        $slug = $this->alpanumeric(5);
        $query = $Short_db->where('slug', $slug)->first();

        while ($query) {
            $slug = $this->alpanumeric(5);
            $query = $Short_db->where('slug', $slug)->first();
        }

        $query = [
            'url' => $url,
            'user_id' => $user_id,
            'slug' => $slug,
            'counter' => 0,
            'is_active' => 1,
            'created_at' => date("Y-m-d H:i:s", time())
        ];

        $Short_db->save($query);

SELECT *
FROM `short`
WHERE `slug` = 'X18kL'
 LIMIT 1
---
    public function setter()
    {
        $slug = $this->request->getVar('slug');

        $Short_db = new ShortModel();
        $query = $Short_db->where('slug', $slug)->first();

DELETE FROM `short`
WHERE `slug` = 'gKwWP'
---
    public function delete()
    {
        $slug = $this->request->getVar('slug');

        $Short_db = new ShortModel();
        $query = $Short_db->where('slug', $slug)->delete();