app/Controllers/User.php

SELECT *
FROM `users`
WHERE `name` = 'cos1'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $user_db = new UserModel();

        $name = $this->request->getVar('name');
        $password = $this->request->getVar('password');

        $data = $user_db->where('name', $name)->first();